<?php if (!defined('THINK_PATH')) exit();?><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>学习方法</title>
<style type="text/css">
.居中 {
	text-align: center;
	font-weight: bold;
	font-size: 36px;
}
.jiacu {
	font-weight: bold;
}
body,td,th {
	color: #000;
}
</style>
</head>

<body>
<div style="width:1007px; margin-left:auto; margin-right:auto">
<p class="居中">学习方法</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 本课程教学方法以实践项目教学和过程化考核为主线，以多种方法合适选用或创造为载体，以提高教学效果和质量为目标。由于本课程的教学目的不仅是让学生掌握多媒体制作的基本要求和方法，更重要的是改变学生的学习方式，促进学生学会学习。通过选用典型题目，由教师提出要求或示范，组织学生进行活动，让学生在活动中增强团队合作和开拓创新意识，掌握本课程的职业能力。运用思考、实践、调查、探索、讨论、交流、展示、评价等多种形式促使学生自行设计学习方案，自主探索操作步骤和实验方法，在学习过程中发现问题、提出问题，加强师生、生生之间的讨论、交流和展示。 </p>
<p >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="jiacu"> 1、</span>任务驱动、项目式导向式教学。任务驱动教学本质上应是通过&#8220;任务&#8221;来诱发、加强和维持学习者的成就动机。实践证明，学生在完成一个与他们的实际生活与学习密切相关而且比较有趣的学习任务时，他们会非常专心致志、乐此不疲，例如：在学习实践教学内容时，整个&#8220;学中做&#8221;阶段都围绕完成视频作品的任务，在校内实验实训基地，教师首先教会学生视频制作的基本知识及技巧，然后给学生布置&#8220;任务&#8221;，完成一个项目，在项目过程中掌握新的知识内容，遇到问题教师能及时答疑解惑。 </p>
<p >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;<span class="jiacu">&nbsp;2、</span>教师重视学习现代教学理论，不断更新观念，加强多媒体技术与应用课程与各课程的整合的研究，充分运用项目教学法，探索在数字化学习环境下的新型教学模式，为学生提供自主发展的时间和空间，努力培养学生的创新精神和实践能力，自觉地成为学生学习的引导者和促进者。 </p>
<p >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="jiacu">&nbsp;3、</span>讲练查结合式教学。高职学生的学习主动性不够高，在实践性内容比较多的教学过程中，练习时间相对也比较多了，但有些学生不会主动地进行练习，即使练习了效果也不一定好，练习还必须让能举一反三，根据经验说明：必须在练习后进行检查记分，当然检查的方式可以灵活一些，可操作性要强一些，这样能比较好地调动学生的学习积极性。 </p>
<p >&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;<span class="jiacu">4、</span>案例分析式教学。针对胜任职业岗位（群）的需要，将课程的教学目标分解为知识目标、技能目标和体验性目标，再将知识目标分解为&nbsp;&#8220;了解&#8221;&#8212;&#8212;&#8220;理解&#8221;&#8212;&#8212;&#8220;应用&#8221;三步；将技能目标分解为&#8220;模仿&#8221;&#8212;&#8212;&#8220;独立操作&#8221;&#8212;&#8212;&#8220;应用&#8221;三步；将过程与方法的培养纳入课程教学目标。将构造学生知识、能力、素质三位一体的原则落实到课程教学的始终，注重学生综合素质的提高、岗位技能的掌握、专业知识的综合运用。 </p>
<p >&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class="jiacu"> &nbsp;5、</span>坚持实行课程机考形式，提高学生的动手能力。教学过程的各个环节都十分强调应用，每个模块都要求学生完成一项综合性的实验，同时利用网络平台加强教师与学生的教学交互。 </p>
</div>
</body>
</html>